# Mesh Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh Class
Members See Also
---
A triangular mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Mesh : GeometryObject
```

Visual Basic
---
```text
Public Class Mesh _
	Inherits GeometryObject
```

Visual C++
---
```text
public ref class Mesh : public GeometryObject
```

# Remarks
Meshes are generated during triangulation of faces. They can also be encountered directly in Revit geometry (typically imported geometry). Meshes contain a single array of Vertices, and a corresponding array of triangles. Triangles can be accessed by index from [Triangle[([( Int32])]) ](35abd642-cf15-8281-e45d-083fb5c53d2a.md "Triangle Property"), and reference 3 vertices from the Vertices array.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..Mesh
# See Also
Mesh Members
Autodesk.Revit.DB Namespace